Revit 2027 API
ParameterTypeId.BendingDetailTypeDiameterDimensionTypeId Property
 "Diameter Dimension Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeDiameterDimensionTypeId { get; }
Public Shared ReadOnly Property BendingDetailTypeDiameterDimensionTypeId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeDiameterDimensionTypeId {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeDiameterDimensionTypeId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace